{
    "Mobile": {
        "title": "Portafolio de Christian Dom칤nguez",
        "message": "Parece que est치s utilizando un dispositivo m칩vil. Por favor, utiliza un dispositivo de escritorio para una mejor experiencia 游땔"
    },
    "Welcome": {
        "subtitle": "Desarrollador de Software Full-Stack"
    },
    "Header": {
        "education": "Educaci칩n",
        "experience": "Experiencia",
        "projects": "Proyectos",
        "skills": "Habilidades",
        "frameworks": "Frameworks",
        "languages": "Idiomas",
        "contact": "Contacto"
    },
    "Education": {
        "education": "Educaci칩n",
        "ub_title": "M치ster Erasmus Mundus en Qu칤mica Te칩rica y Computacional - Universitat de Barcelona",
        "ub_description": "M치ster internacional europeo con asignaturas en toda Europa. Fundamentos matem치ticos de la mec치nica cu치ntica, an치lisis y ciencia de datos. Programaci칩n de algoritmos num칠ricos.",
        "uab_title": "Grado en Qu칤mica - Universitat Aut쑕oma de Barcelona",
        "uab_description": "Grado en qu칤mica: qu칤mica org치nica, qu칤mica inorg치nica, materiales, t칠cnicas anal칤ticas y qu칤mica cu치ntica. Especializaci칩n en qu칤mica computacional."
    },
    "Experience": {
        "experience": "Experiencia",
        "bsc_title": "Desarrollador Full-Stack en el Barcelona Supercomputing Center",
        "bsc_description": "Desarrollador de software en el departamento de Ciencias de la Vida. Desarrollo de interfaces gr치ficas de usuario de escritorio y aplicaciones web para c치lculos en HPC, manipulaci칩n de datos y visualizaci칩n molecular.",
        "ub_researcher": "Investigador en la Universidad de Barcelona",
        "ub_title": "Investigador en la Universidad de Barcelona",
        "ub_description": "Investigador en el Instituto de Qu칤mica Computacional y Te칩rica. Desarrollo de algoritmos, campos de fuerza y software para realizar simulaciones moleculares."
    },
    "Projects": {
        "projects": "Proyectos",
        "charted_description": "Crea gr치ficos de regresi칩n 칰tiles en dispositivos m칩viles.",
        "atomic_description": "Visualizador molecular para macOS e iPadOS.",
        "mc_description": "Simulaciones Monte Carlo para l칤quidos at칩micos.",
        "yielddb_description": "Plataforma de recolecci칩n de datos de expresi칩n proteica.",
        "nostrum_description": "Ejecuta simulaciones moleculares desde la web.",
        "horus_description": "Visualizador molecular y gestor de flujos de trabajo para entornos HPC.",
        "horus_plugin_repo_description": "Un repositorio p칰blico para subir plugins de Horus.",
        "this_portfolio": "Este portafolio",
        "this_portfolio_description": "Portafolio de Christian Dom칤nguez.",
        "your_next_project": "Tu pr칩ximo proyecto",
        "your_next_project_description": "Aqu칤 va tu nuevo proyecto."
    },
    "Skills": {
        "skills": "Habilidades",
        "python_description": "Desarrollo de software cient칤fico y backends web con frameworks como Flask, FastAPI, Dash...",
        "html_description": "Tecnolog칤as fundamentales para construir p치ginas web e implementar funcionalidades din치micas en el navegador.",
        "typescript_description": "Un superset de JavaScript que mejora la fiabilidad del c칩digo.",
        "shell_description": "Scripting y automatizaci칩n de tareas desde la l칤nea de comandos.",
        "c_description": "Un lenguaje de programaci칩n de bajo nivel para programaci칩n de sistemas.",
        "swift_description": "Un lenguaje moderno y potente para desarrollar aplicaciones iOS y macOS."
    },
    "Frameworks": {
        "frameworks": "Frameworks",
        "git_description": "Un sistema de control de versiones utilizado para rastrear cambios en el c칩digo fuente durante el desarrollo de software.",
        "mongodb_description": "Una base de datos NoSQL que almacena datos en documentos de tipo JSON.",
        "react_description": "Una biblioteca de JavaScript popular para construir interfaces de usuario.",
        "keycloak_description": "Una soluci칩n de gesti칩n de identidad y acceso de c칩digo abierto.",
        "fastapi_description": "Un framework web de Python de alto rendimiento para construir APIs.",
        "flask_description": "Un framework web de Python ligero para construir aplicaciones web.",
        "vite_description": "Una herramienta de construcci칩n y servidor de desarrollo r치pido para proyectos web modernos.",
        "nextjs_description": "Un framework de React para construir aplicaciones de pila completa.",
        "nginx_description": "Un servidor web de alto rendimiento y servidor proxy inverso utilizado para balanceo de carga.",
        "docker_description": "Una plataforma de contenedorizaci칩n que permite a los desarrolladores empaquetar aplicaciones con todas sus dependencias.",
        "cicd_description": "Pr치cticas de Integraci칩n Continua y Despliegue Continuo que automatizan el proceso de lanzamiento de software."
    },
    "FindMe": {
        "contact": "Contacto",
        "find_me": "Contacta"
    },
    "Languages": {
        "languages": "Idiomas",
        "change_language": "Haz clic para cambiar el idioma de la p치gina"
    },
    "Alts": {
        "college": "Universidad",
        "company": "Empresa",
        "learn_more": "Ver m치s"
    }
}